emacs/modes/yasnippet-mode.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-03-25 三 16:18 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>yasnippet mode</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="刘尚亮" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://phenix3443.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">yasnippet mode</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4015040">1. 概述</a></li>
<li><a href="#orgfae46c1">2. 快捷键</a></li>
<li><a href="#org6073813">3. 文件内容</a>
<ul>
<li><a href="#orgd341839">3.1. # key: snippet abbrev</a></li>
<li><a href="#org3f5252d">3.2. # name: snippet name</a></li>
<li><a href="#orgd1cfd79">3.3. # condition: snippet condition</a></li>
<li><a href="#org4383b12">3.4. # group: snippet menu grouping</a></li>
<li><a href="#orgbe82993">3.5. # expand-env: expand environment</a></li>
<li><a href="#orga100047">3.6. # binding: direct keybinding</a></li>
<li><a href="#org3664651">3.7. # type: snippet or command</a></li>
<li><a href="#orgd0a0742">3.8. # uuid: unique identifier</a></li>
<li><a href="#org3d7612e">3.9. # contributor: snippet author</a></li>
</ul>
</li>
<li><a href="#org5e7a58a">4. 模板语法</a>
<ul>
<li><a href="#orgcb6dcff">4.1. Plain Text</a></li>
<li><a href="#org3ba2db5">4.2. Embedded Emacs-lisp code</a></li>
<li><a href="#orgc8e838e">4.3. Tab stop fields</a></li>
<li><a href="#orgb86b5ff">4.4. Placeholder fields</a></li>
<li><a href="#orgb39a7e1">4.5. Mirrors</a></li>
<li><a href="#orgcaf2c6f">4.6. Mirrors with transformations</a></li>
<li><a href="#org2ce057e">4.7. Fields with transformations</a></li>
<li><a href="#orga2bb2e8">4.8. Choosing fields value from a list and other tricks</a></li>
<li><a href="#org38f459c">4.9. Nested placeholder fields</a></li>
<li><a href="#org6258923">4.10. Indentation markers</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org4015040" class="outline-2">
<h2 id="org4015040"><span class="section-number-2">1</span> 概述</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="https://github.com/capitaomorte/yasnippet">Yasnippet</a> 是 Emacs 的模板系统。它可以将输入的缩写扩展为函数模板。绑定的语言模板包括  C, C++, C#, Perl, Python, Ruby, SQL, LaTeX, HTML, CSS 等等。snippet 语法来自 TextMate 语法，甚至可以导入 TextMate 的大多数模板。
</p>
</div>
</div>


<div id="outline-container-orgfae46c1" class="outline-2">
<h2 id="orgfae46c1"><span class="section-number-2">2</span> 快捷键</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><p>
M-x yas-new-snippet, key bindind: C-c &amp; C-n
</p>

<p>
新建 snippet
</p></li>

<li><p>
M-x yas-visit-snippet-file, key binding: C-c &amp; C-v
</p>

<p>
查看已有的 snippet
</p></li>
</ul>

<p>
snippet 相关的操作会在 snippet-mode 中进行。snippet-mode 中可以有如下命令：
</p>

<ul class="org-ul">
<li><p>
M-x yas-load-snippet-buffer, key binding: C-c C-l
</p>

<p>
提示一个 snippet table（默认是 snippet 的 major mode），并加载当前正在编辑的 snippet。
</p></li>

<li><p>
M-x yas-load-snippet-buffer-and-close, key binding: C-c C-c
</p>

<p>
类似 yas-load-snippet-buffer，但还会保存 snippet 并调用 quit-window。
</p></li>

<li><p>
M-x yas-tryout-snippet, key binding: C-c C-t
</p>

<p>
编辑 snippet 时，会打开一个新的空缓冲区，将其设置为适当的 major mode 在其中插入代码片段，以便查看它的外观。此功能可以用来方便的调试正在编辑的 snippet。
</p></li>
</ul>
</div>
</div>

<div id="outline-container-org6073813" class="outline-2">
<h2 id="org6073813"><span class="section-number-2">3</span> 文件内容</h2>
<div class="outline-text-2" id="text-3">
<p>
snippet 通常包含要展开的模板内容。
</p>

<p>
如果文件包含一行 <code>＃--</code> ，则它上面的行将被视为注释，其中一些可以是指令（或元数据）。snippet 指令看起来像 <code>＃property：value</code> ，可以调整下面描述的 snippet 属性。如果找不到 <code>＃--</code> ，则整个文件被认为是片段模板。
</p>

<p>
以下是一个典型示例：
</p>
<pre class="example">
# contributor: pluskid &lt;pluskid@gmail.com&gt;
# name: __...__
# --
__${init}__
</pre>
</div>

<div id="outline-container-orgd341839" class="outline-3">
<h3 id="orgd341839"><span class="section-number-3">3.1</span> # key: snippet abbrev</h3>
<div class="outline-text-3" id="text-3-1">
<p>
这可能是最重要的指令，它是在键入运行 <b>yas-expand</b> 之前展开代码段的缩写。如果不指定该项，snippet 不能通过触发机制来扩展。
</p>
</div>
</div>

<div id="outline-container-org3f5252d" class="outline-3">
<h3 id="org3f5252d"><span class="section-number-3">3.2</span> # name: snippet name</h3>
<div class="outline-text-3" id="text-3-2">
<p>
这是 snippet 的单行描述。它将显示在菜单中。为 snippet 选择描述性名称是一个不错的主意 - 尤其是可用于和类似 snippet 加以区分。
</p>

<p>
如果省略该名字，它将默认为加载 snippet 的文件名。
</p>
</div>
</div>

<div id="outline-container-orgd1cfd79" class="outline-3">
<h3 id="orgd1cfd79"><span class="section-number-3">3.3</span> # condition: snippet condition</h3>
<div class="outline-text-3" id="text-3-3">
<p>
这是 Emacs-lisp 代码片段。如果一个 snippet 有一个条件，那么只有当条件代码求值为非零值时才会扩展。
</p>
</div>
</div>

<div id="outline-container-org4383b12" class="outline-3">
<h3 id="org4383b12"><span class="section-number-3">3.4</span> # group: snippet menu grouping</h3>
<div class="outline-text-3" id="text-3-4">
<p>
当从菜单栏菜单展开/访问 snippet 时，给定模式的 snippet 可以分组到子菜单中。这可以避免有过多 snippet 的 mode 菜单过长。
</p>

<p>
<code>＃group：</code> 属性只影响菜单结构（请参阅<a href="https://joaotavora.github.io/yasnippet/snippet-menu.html"> YASnippet</a> 菜单），通过将 snippet 分组到子目录中并使用 <code>.yas-make-groups</code> 特殊文件可以实现相同的效果（有关此内容，请参阅<a href="https://joaotavora.github.io/yasnippet/snippet-organization.html">Organizing Snippets</a>）
</p>

<p>
有关 <code>＃group：</code> 指令的示例，请参阅的 <code>ruby-mode</code> 代码片段。Group 也可以嵌套，例如， <code>structure.loops</code> 说明 snippet 位于 loop group 下，而 loop 位于 Control structure Group 下。
</p>
</div>
</div>

<div id="outline-container-orgbe82993" class="outline-3">
<h3 id="orgbe82993"><span class="section-number-3">3.5</span> # expand-env: expand environment</h3>
<div class="outline-text-3" id="text-3-5">
<p>
这是另一个 Emacs-lisp 代码片段，以 <code>let varlist</code> 形式出现，例如一个列出给变量赋值的列表。可以用来在 snippet 扩展时覆盖变量值。
</p>
<pre class="example">
# name: ASCII home
# expand-env: ((yas-indent-line 'fixed) (yas-wrap-around-region 'nil))
# --
                welcome to my
            X      humble
           / \      home,
          /   \      $0
         /     \
        /-------\
        |       |
        |  +-+  |
        |  | |  |
        +--+-+--+
</pre>
</div>
</div>

<div id="outline-container-orga100047" class="outline-3">
<h3 id="orga100047"><span class="section-number-3">3.6</span> # binding: direct keybinding</h3>
<div class="outline-text-3" id="text-3-6">
<p>
您可以使用此指令直接从正常的 Emacs 键绑定扩展 snippet。键盘绑定将被注册在 Emacs 键盘映射表中，该键盘映射以 snippet 生效的主模式命名。
</p>

<p>
另外，变量 yas-prefix 被设置为常用命令的前缀参数。这允许在相同的 snippet 有小的变化，例如在这个“html-mode”片段。
</p>

<pre class="example">
# name: &lt;p&gt;...&lt;/p&gt;
# binding: C-c C-c C-m
# --
&lt;p&gt;`(when yas-prefix "\n")`$0`(when yas-prefix "\n")`&lt;/p&gt;
</pre>
<p>
该绑定将被记录在 html-mode-map 中。要扩展段落标签换行符，只需按 C-u C-c C-c C-m。省略 C-u 将会扩展段落标签而不换行。
</p>
</div>
</div>

<div id="outline-container-org3664651" class="outline-3">
<h3 id="org3664651"><span class="section-number-3">3.7</span> # type: snippet or command</h3>
<div class="outline-text-3" id="text-3-7">
<p>
如果 type 指令被设置为 command，则 snippet 的主体被解释为 lisp code，并在触发 snippet 时候求值。
</p>

<p>
如果该值是 snippet（没有 type 指令时的缺省值），则 snippet 正文将根据下面描述的模板语法进行分析。
</p>
</div>
</div>

<div id="outline-container-orgd0a0742" class="outline-3">
<h3 id="orgd0a0742"><span class="section-number-3">3.8</span> # uuid: unique identifier</h3>
<div class="outline-text-3" id="text-3-8">
<p>
这提供了一种识别 snippet 的方式，与名称无关。使用相同的 uuid 加载第二个 snippet 文件将替换之前的 snippet。
</p>
</div>
</div>

<div id="outline-container-org3d7612e" class="outline-3">
<h3 id="org3d7612e"><span class="section-number-3">3.9</span> # contributor: snippet author</h3>
<div class="outline-text-3" id="text-3-9">
<p>
这是可选的，对 snippet 功能没有任何影响，但看起来不错。
</p>
</div>
</div>
</div>

<div id="outline-container-org5e7a58a" class="outline-2">
<h2 id="org5e7a58a"><span class="section-number-2">4</span> 模板语法</h2>
<div class="outline-text-2" id="text-4">
<p>
snippet 模板的语法很简单但功能强大，与 TextMate 非常相似。
</p>
</div>

<div id="outline-container-orgcb6dcff" class="outline-3">
<h3 id="orgcb6dcff"><span class="section-number-3">4.1</span> Plain Text</h3>
<div class="outline-text-3" id="text-4-1">
<p>
可以包含任意文本作为模板的内容。它们通常被解释为纯文本，除了 <code>$</code> 和 <code>`</code> 。您需要使用 <code>\</code> 来转义它们： <code>\$</code> 和 <code>\`</code> 。 <code>\</code> 本身也可能需要 <code>\\</code> 进行转义。
</p>
</div>
</div>

<div id="outline-container-org3ba2db5" class="outline-3">
<h3 id="org3ba2db5"><span class="section-number-3">4.2</span> Embedded Emacs-lisp code</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Emacs-Lisp 代码可以嵌入到模板内部，写在反引号（`）中。当 snippet 被展开时，将求值 lisp 表达式。求值在 snippet 展开的 buffer 中完成。
</p>

<p>
下面是一个用于动态计算头文件防护的 c 模式示例：
</p>
<pre class="example">
#ifndef ${1:_`(upcase (file-name-nondirectory (file-name-sans-extension (buffer-file-name))))`_H_}
#define $1

$0

#endif /* $1 */
</pre>
<p>
从版本 0.6 开始，snippets 扩展会运行一些特殊的 Emacs-lisp 变量。其中之一是 <code>yas-selected-text</code> 。因此，可以定义一个片段，如：
</p>
<pre class="example">
for ($1;$2;$3) {
  `yas-selected-text`$0
}

</pre>
<p>
在最近插入的代码片段中“包装”选定的区域。另外，你也可以将 <code>yas-wrap-around-region</code> 设置为 t 来自动执行此功能。
</p>

<p>
<b>注意：反引号表达式不应修改缓冲区</b>
</p>

<p>
请注意，反引号中的 lisp 表单不应修改缓冲区，否则会触发警告。例如，不应该这么做：
</p>
<pre class="example">
Timestamp: `(insert (current-time-string))`
</pre>
<p>
而是：
</p>
<pre class="example">
Timestamp: `(current-time-string)`
</pre>
<p>
警告可能会被 init 文件中的下列代码所抑制：
</p>
<div class="org-src-container">
<pre class="src src-elisp">(add-to-list 'warning-suppress-types '(yasnippet backquote-change))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc8e838e" class="outline-3">
<h3 id="orgc8e838e"><span class="section-number-3">4.3</span> Tab stop fields</h3>
<div class="outline-text-3" id="text-4-3">
<p>
tab stop 是可以通过 TAB 和 S-TAB 来回导航的字段。它们是 <code>$</code> 后跟一个数字。 <code>$0</code> 具有 snippet 出口点的特殊含义。当遍历完所有的字段后，这是最后的去处。这是一个典型的例子：
</p>

<pre class="example">
&lt;div$1&gt;
    $0
&lt;/div&gt;
</pre>
</div>
</div>

<div id="outline-container-orgb86b5ff" class="outline-3">
<h3 id="orgb86b5ff"><span class="section-number-3">4.4</span> Placeholder fields</h3>
<div class="outline-text-3" id="text-4-4">
<p>
tab stop 可有一个默认值&#x2013;a.k.a 占位符。语法是这样的：
</p>
<pre class="example">
${N:default value}
</pre>
<p>
它们充当 tab stop 的默认值。但是，当您首先键入 tab stop 时，默认值将被您的输入替换。如果您不想为该字段创建 mirrors 或 transformations，则可以省略该字段。
</p>
</div>
</div>

<div id="outline-container-orgb39a7e1" class="outline-3">
<h3 id="orgb39a7e1"><span class="section-number-3">4.5</span> Mirrors</h3>
<div class="outline-text-3" id="text-4-5">
<p>
带有占位符的 tab stop 当成一个字段。字段可以有 mirror。当更改字段的文本时，它的 mirror 将会更新。这是一个例子：
</p>
<pre class="example">
\begin{${1:enumerate}}
    $0
\end{$1}
</pre>
<p>
当在 <code>${1：enumerate}</code> 处键入“document”时，单词“document”也将被插入到 <code>\end{$1}</code> 中。
</p>

<p>
与字段相同的数字 tab stop 作为镜像。如果任何 tab stop 都没有初始值，则第一个 tab stop 将被选作字段而其他 tab stop 为 mirror。
</p>
</div>
</div>

<div id="outline-container-orgcaf2c6f" class="outline-3">
<h3 id="orgcaf2c6f"><span class="section-number-3">4.6</span> Mirrors with transformations</h3>
<div class="outline-text-3" id="text-4-6">
<p>
如果 <code>${n：</code> 结构的的值以 <code>$</code> 开头，并且包含 <code>$()</code> ，那么它将被解释为字段 n 带有转换（transformations）的 mirror。mirror 的文本内容是根据这个转换来计算的，该转换是在一个环境中求值的 Emacs-lisp 代码。同时在该环境中，变量 <code>yas-text</code> 绑定到字段 n 中包含的文本内容。下面是一个 Objective-C 的例子：
</p>

<pre class="example">
- (${1:id})${2:foo}
{
    return $2;
}

- (void)set${2:$(capitalize yas-text)}:($1)aValue
{
    [$2 autorelease];
    $2 = [aValue retain];
}
$0
</pre>
<p>
看 <code>${2:$(capitalize yas-text)}</code> ，它是一个带有转换的镜像而不是一个字段。实际的字段在第一行： <code>${2:foo}</code> 。当在 <code>$ {2:foo}</code> 中键入文本时，转换将被求值，结果将被作为转换后的文本放置在那里。所以在这个例子中，如果在 field 中输入“baz”，转换的文本将是“Baz”。
</p>


<p>
另一个例子是 rst-mode。reStructuredText 中，文档标题可以是下面和上面的由“=”包围的一些文本。 “=”应该至少与文本一样长。所以
</p>
<pre class="example">
=====
Title
=====
</pre>
<p>
是有效的，但
</p>
<pre class="example">
===
Title
===
</pre>
<p>
不是。下爱面是 rst 标题的一个 snippet：
</p>
<pre class="example">
${1:$(make-string (string-width yas-text) ?\=)}
${1:Title}
${1:$(make-string (string-width yas-text) ?\=)}

$0
</pre>
</div>
</div>
<div id="outline-container-org2ce057e" class="outline-3">
<h3 id="org2ce057e"><span class="section-number-3">4.7</span> Fields with transformations</h3>
<div class="outline-text-3" id="text-4-7">
<p>
从 0.6 版本开始，也可以在字段里面进行 lisp 转换。这些工作主要与转换类似，但是第一次输入该字段，每次改变字段，以及在你退出该字段时才会求值。
</p>

<p>
语法也有点不同，所以解析器可以区分 field 和 mirror。在下面的例子中
</p>

<pre class="example">
#define "${1:mydefine$(upcase yas-text)}"
</pre>
<p>
一旦输入该字段，mydefine 会自动升级到 MYDEFINE。当你输入文本时，每次都会通过转换过滤。
</p>

<p>
请注意，这种表达式为和与带转化的 mirror 区别，YASnippet 需要在 <code>:</code> 和转换的 <code>$</code> 之间添加额外的文本。如果你不想要这个额外的文字，你可以使用两个 <code>$</code> 。
</p>
<pre class="example">
#define "${1:$$(upcase yas-text)}"
</pre>
<p>
请注意，只要转换发生，它就会更改 field 的值，并将其内部修改状态设置为 true。因此，正常字段的自动删除行为不会发生。就是这么设计的。
</p>
</div>
</div>

<div id="outline-container-orga2bb2e8" class="outline-3">
<h3 id="orga2bb2e8"><span class="section-number-3">4.8</span> Choosing fields value from a list and other tricks</h3>
<div class="outline-text-3" id="text-4-8">
<p>
如前所述，在输入字段后调用 field 转换，并且绑定了一些有用的变量，特别是 <code>yas-modified-p</code> 和 <code>yas-moving-away-p</code> 。因此，可以在主字段中放置一个转换，使您可以为其选择默认值。
</p>

<p>
看看 yas-choose-value 的定义，看看它是如何使用这两个变量来编写的。
</p>

<p>
这里还有一个用于 LaTeX-mode 的例子，正如输入 snippet 字段 2 一样调用 reftex-label。这个方法直接使用 <code>yas-modified-p</code> 。
</p>

<pre class="example">
\section{${1:"Titel der Tour"}}%
\index{$1}%
\label{{2:"waiting for reftex-label call..."$(unless yas-modified-p (reftex-label nil 'dont-
insert))}}%
</pre>
<p>
函数 yas-verify-value 有另一个巧妙的技巧，并且使用 yas-moving-away-p。可以在<a href="http://groups.google.com/group/smart-snippet/browse_thread/thread/282a90a118e1b662">thread</a> 试试。
</p>
</div>
</div>

<div id="outline-container-org38f459c" class="outline-3">
<h3 id="org38f459c"><span class="section-number-3">4.9</span> Nested placeholder fields</h3>
<div class="outline-text-3" id="text-4-9">
<p>
从 0.6 版本开始，也可以类型嵌套占位符：
</p>
<pre class="example">
&lt;div${1: id="${2:some_id}"}&gt;$0&lt;/div&gt;
</pre>
<p>
这允许你选择是否给这个 div 一个 id 属性。如果您在展开之后向前移动，则可以将“some_id”更改为任何您喜欢的内容。或者，可以按 C-d（执行 <code>yas-skip-and-clear-or-delete-char</code> ）并直接转到出口标记。
</p>
</div>
</div>

<div id="outline-container-org6258923" class="outline-3">
<h3 id="org6258923"><span class="section-number-3">4.10</span> Indentation markers</h3>
<div class="outline-text-3" id="text-4-10">
<p>
如果yas-indent-line未设置为“auto”，则仍然可以通过在线上某处添加缩进标记$&gt;来缩进。
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: 刘尚亮</p>
<p class="email">Email: <a href="mailto:phenix3443+github@gmail.com">phenix3443+github@gmail.com</a></p>
<p class="date">Created: 2020-03-25 三 16:18</p>
<p class="validation"></p>
</div>
</body>
</html>
